<?php
    $lang = "ru";
    /*------------первый способ----------*/
    if ($lang == "ru")
        $arr = ["понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"];
    if ($lang == "en")
        $arr = ["monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday"];

    echo "ПЕРВЫЙ СПОСОБ:  " . $arr[0] .", ". $arr[1]  .", ".$arr[2]  .", ". $arr[3]  .", ". $arr[4]  .", ". $arr[5]  .", ". $arr[6] ;
    /*-----------------------------------*/
    echo"<br>";
    /*------------второй способ----------*/
    switch($lang = "en"){

        case $lang = "ru" : 
            $arr = ["понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"];
            echo "ВТОРОЙ СПОСОБ:  " . $arr[0] .", ". $arr[1]  .", ".$arr[2]  .", ". $arr[3]  .", ". $arr[4]  .", ". $arr[5]  .", ". $arr[6] ;
            break;

        case $lang = "en": 
            $arr = ["monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday"];
            echo "ВТОРОЙ СПОСОБ:  " . $arr[0] .", ". $arr[1]  .", ".$arr[2]  .", ". $arr[3]  .", ". $arr[4]  .", ". $arr[5]  .", ". $arr[6] ;
            break;
    }
    /*-----------------------------------*/
    echo"<br>";
    /*------------третий способ----------*/
    
    $lang = ["ru" =>"понедельник" . ", " . "вторник" . ", " . "среда"  . ", " ."четверг"  . ", " ."пятница"  . ", " ."суббота" . ", " . "воскресенье",
    "en"=>"monday". ", " ."tuesday". ", " . "wednesday". ", " ."thursday". ", " ."friday". ", " ."saturday". ", " . "sunday"];

    echo "ТРЕТИЙ СПОСОБ: " . $lang["ru"];
    